# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSetIterator..::..Current Property
AssetSetIterator Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Object Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As Object
	Get
```

Visual C++
---
```text
public:
virtual property Object^ Current {
	Object^ get ();
}
```

# ### Implements
IEnumerator..::..Current
# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace